joscor34/CatSneeze_toolkit/firmware/nrf24_sniffer_cc1352p7/nrf24_sniffer.c
/**
 * nrf24_sniffer.c — Firmware principal para CC1352P7
 *
 * Captura paquetes Enhanced ShockBurst (nRF24L01+) en modo promiscuo
 * o dirigido, y los envía por UART en formato legible/parseable por Python.
 *
 * ┌─────────────────────────────────────────────────────────────────────┐
 * │  COMPILACIÓN: requiere TI SimpleLink CC13xx/CC26xx SDK ≥ 7.10      │
 * │  Ver README.md para instrucciones de build completas                │
 * └─────────────────────────────────────────────────────────────────────┘
 *
 * Protocolo UART (115200 8N1):
 *   Líneas del firmware → host:
 *     [INIT] ch=076 freq=2476MHz rate=1M mode=PROMISC
 *     [PKT]  ch=076 rssi=-055 len=37 raw=AABBCC...
 *     [ESB]  ch=076 rssi=-055 addr=E7E7E7E7E7 plen=8 pid=0 noack=0 pld=... crc=OK
 *     [ACK]  ch=076 rssi=-055 addr=E7E7E7E7E7 empty
 *     [SCAN] ch=076 active=1 pkts=3 rssi_max=-045
 *     [ERR]  descripción
 *
 *   Comandos host → firmware:
 *     CH:076\r\n            → cambiar canal (0-125)
 *     CH:SCAN\r\n           → modo escaneo (ciclos por todos los canales)
 *     ADDR:E7E7E7E7E7\r\n   → modo dirigido con address dada
 *     MODE:PROMISC\r\n      → modo promiscuo
 *     RATE:1M\r\n           → 1 Mbps
 *     RATE:2M\r\n           → 2 Mbps
 *     RATE:250K\r\n         → 250 kbps
 */

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>
#include <ctype.h>

/* TI SimpleLink SDK */
#include <ti/drivers/rf/RF.h>
#include <ti/drivers/UART2.h>
#include <ti/drivers/Board.h>

/* NoRTOS + DPL */
#include <NoRTOS.h>
#include <ti/drivers/dpl/ClockP.h>

/* Device-specific */
#include <ti/devices/cc13x2x7_cc26x2x7/driverlib/rf_prop_mailbox.h>
#include <ti/devices/cc13x2x7_cc26x2x7/driverlib/rf_prop_cmd.h>
#include <ti/devices/cc13x2x7_cc26x2x7/driverlib/rfc.h>

/* Nuestros headers */
#include "smartrf_settings.h"
#include "nrf24_esb.h"
#include "ti_drivers_config.h"

/* ── Configuración ─────────────────────────────────────────────────────────── */

#define NRF24_UART_BAUD         115200u
#define NRF24_RX_BUF_LEN        64u     /* bytes para CMD_PROP_RX_ADV */
#define NRF24_CMD_BUF_LEN       32u     /* bytes para comandos UART entrantes */
#define NRF24_DEFAULT_CHANNEL   76u     /* 2476 MHz — default muchas libs Arduino */
#define NRF24_SCAN_DWELL_MS     20u     /* ms por canal en modo SCAN */
#define NRF24_MAX_CHANNELS      126u    /* canales 0–125 */

/* Task RTOS */
#define NRF24_TASK_STACK_SIZE   2048u
#define NRF24_CMD_TASK_STACK    1024u

/* ── Tipos internos ─────────────────────────────────────────────────────────── */

typedef enum {
    MODE_PROMISC  = 0,  /* modo promiscuo: sync word = 0xAAAAAAAA */
    MODE_DIRECTED = 1,  /* modo dirigido: sync word = address del target */
    MODE_SCAN     = 2,  /* escaneo secuencial de canales 0-125 */
} sniffer_mode_t;

typedef struct {
    sniffer_mode_t mode;
    uint8_t        channel;          /* canal actual 0-125 */
    nrf24_rate_t   rate;             /* 1M / 2M / 250K */
    uint8_t        target_addr[5];   /* address en modo DIRECTED */
    uint8_t        target_aw;        /* address width en modo DIRECTED */
} sniffer_state_t;

/* ── Variables globales ─────────────────────────────────────────────────────── */

static UART2_Handle  g_uart;
static RF_Object     g_rfObject;
static RF_Handle     g_rfHandle;
static sniffer_state_t g_state = {
    .mode    = MODE_PROMISC,
    .channel = NRF24_DEFAULT_CHANNEL,
    .rate    = NRF24_RATE_1MBPS,
    .target_aw = 5,
};

/* Buffer de recepción RF (shared con RF core DMA) */
static uint8_t g_rxBuf[NRF24_RX_BUF_LEN]  __attribute__((aligned(4)));
/* Buffer de transmisión (frame ESB construido por esb_build_frame) */
static uint8_t g_txBuf[ESB_MAX_FRAME_LEN]  __attribute__((aligned(4)));
/* Buffer de entrada UART para comandos */
static char    g_cmdBuf[NRF24_CMD_BUF_LEN];
/* Recepción UART asíncrona (callback en NoRTOS) */
static volatile bool   g_cmdReady = false;
static volatile char   g_rxChar;
static size_t          g_cmdIdx = 0;

/* ── Helpers UART ───────────────────────────────────────────────────────────── */

/**
 * uart_puts() — Envía string por UART (bloqueante, sin formateo).
 */
static void uart_puts(const char *s)
{
    size_t len = strlen(s);
    UART2_write(g_uart, s, len, NULL);
}

/**
 * uart_printf() — Envía por UART con formato printf().
 * Buffer interno 128 bytes — no usar para payloads grandes.
 */
static void uart_printf(const char *fmt, ...)
{
    char buf[128];
    va_list args;
    va_start(args, fmt);
    vsnprintf(buf, sizeof(buf), fmt, args);
    va_end(args);
    uart_puts(buf);
}

/* ── Inicialización de RF ───────────────────────────────────────────────────── */

/**
 * rf_init() — Abre el driver RF y envía CMD_PROP_RADIO_DIV_SETUP.
 * Debe llamarse una vez en startup.
 */
static bool rf_init(void)
{
    RF_Params rfParams;
    RF_Params_init(&rfParams);

    g_rfHandle = RF_open(&g_rfObject,
                          &RF_prop,             /* RF_Mode generado por SysConfig */
                          (RF_RadioSetup *)&RF_nrf24_cmdPropRadioDivSetup_1M,
                          &rfParams);
    if (g_rfHandle == NULL) {
        uart_puts("[ERR] RF_open failed\r\n");
        return false;
    }
    return true;
}

/**
 * rf_set_channel() — Cambia el canal RF en tiempo real.
 * Para el CC1352P7 en modo propietario 2.4 GHz se modifica centerFreq
 * y se re-ejecuta CMD_PROP_RADIO_DIV_SETUP.
 */
static bool rf_set_channel(uint8_t channel)
{
    if (channel > 125) { return false; }

    /* Actualizar el struct de setup en RAM */
    RF_nrf24_update_channel(channel);

    /* Re-ejecutar el setup para aplicar el nuevo canal */
    RF_runCmd(g_rfHandle,
              (RF_Op *)&RF_nrf24_cmdPropRadioDivSetup_1M,
              RF_PriorityNormal, NULL, 0);
    return true;
}

/**
 * rf_set_sync_word() — Cambia el sync word del CMD_PROP_RX_ADV.
 * Modo promiscuo: 0xAAAAAAAA
 * Modo dirigido:  address del target (4/5 bytes)
 */
static void rf_set_sync_word_promisc(void)
{
    RF_nrf24_cmdPropRxAdv.syncWord0    = 0xAAAAAAAAUL;
    /* syncWordLen is implicit: syncWord0 is always 32 bits */
}

static void rf_set_sync_word_directed(const uint8_t *addr, uint8_t aw)
{
    /* Sync word = preamble (1 byte) + primeros 3 bytes de addr */
    uint8_t preamble = esb_preamble_for_addr(addr);
    RF_nrf24_cmdPropRxAdv.syncWord0 =
        ((uint32_t)preamble   << 24) |
        ((uint32_t)addr[0]    << 16) |
        ((uint32_t)addr[1]    <<  8) |
        ((uint32_t)addr[2]);
    /* syncWordLen is implicit: syncWord0 is always 32 bits */
    (void)aw; /* se podría ampliar a 40 bits para mayor selectividad */
}

