joscor34/CatSneeze_toolkit/firmware/nrf24_sniffer_cc1352p7/nrf24_sniffer.c
/* ── Transmisión TX ──────────────────────────────────────────────────────────── */

/**
 * rf_tx_frame() — Transmite un frame ESB pre-compilado.
 *
 * El frame en tx_buf ya debe contener: addr + PCF + payload + CRC
 * (construido con esb_build_frame). NO incluir preamble.
 *
 * El sync word del CMD_PROP_TX se ajusta automáticamente según el primer
 * byte del frame (dirección), para que el preamble generado sea correcto.
 *
 * @param tx_buf    Puntero al frame ESB listo para TX
 * @param tx_len    Longitud del frame en bytes
 * @return true si CMD_PROP_TX terminó con PROP_DONE_OK
 */
static bool rf_tx_frame(const uint8_t *tx_buf, uint8_t tx_len)
{
    if (!tx_buf || tx_len == 0u || tx_len > ESB_MAX_FRAME_LEN) { return false; }

    /* Ajustar sync word TX según la dirección (primer byte del frame) */
    uint8_t preamble = esb_preamble_for_addr(tx_buf); /* usa el primer byte */
    RF_nrf24_cmdPropTx.syncWord = ((uint32_t)preamble   << 24) |
                                   ((uint32_t)tx_buf[0]  << 16) |
                                   ((uint32_t)tx_buf[1]  <<  8) |
                                   ((uint32_t)tx_buf[2]);

    /* Copiar frame al buffer alineado y configurar el puntero */
    memcpy(g_txBuf, tx_buf, tx_len);
    RF_nrf24_cmdPropTx.pPkt    = g_txBuf;
    RF_nrf24_cmdPropTx.pktLen  = tx_len;
    RF_nrf24_cmdPropTx.status  = 0;

    RF_runCmd(g_rfHandle,
              (RF_Op *)&RF_nrf24_cmdPropTx,
              RF_PriorityNormal, NULL, 0);

    return (RF_nrf24_cmdPropTx.status == PROP_DONE_OK);
}

/* ── Recepción y parseo de un frame ─────────────────────────────────────────── */

/**
 * rx_one_packet() — Espera y recibe un frame crudo del radio.
 *
 * Configura g_rxBuf como destino del CMD_PROP_RX_ADV y ejecuta el
 * comando RF de forma bloqueante (hasta timeout o dato recibido).
 *
 * @param rssi_out   Puntero donde guardar el RSSI (dBm)
 * @param len_out    Bytes recibidos
 * @param timeout_ms Timeout en ms (0 = infinito)
 * @return true si se recibió un frame antes del timeout
 */
static bool rx_one_packet(int8_t *rssi_out, uint8_t *len_out, uint32_t timeout_ms)
{
    /* El struct CMD_PROP_RX_ADV necesita un rfc_propRxOutput_t de estadísticas */
    static rfc_propRxOutput_t rxStats;
    memset(&rxStats, 0, sizeof(rxStats));
    memset(g_rxBuf, 0, sizeof(g_rxBuf));

    RF_nrf24_cmdPropRxAdv.pOutput = (uint8_t *)&rxStats;
    RF_nrf24_cmdPropRxAdv.pQueue  = NULL;  /* directo a g_rxBuf, no DataQueue */

    /*
     * NOTA IMPLEMENTACIÓN: Para una solución más robusta usar
     * rfc_dataEntryPointer_t y RF_runCmd con dataQueue. Este esquema
     * simplificado guarda el primer paquete en g_rxBuf directamente.
     * Para un firmware de producción, usar el ejemplo "rfPacketRX"
     * del SDK que muestra el patrón DataQueue completo.
     */
    RF_nrf24_cmdPropRxAdv.pOutput = g_rxBuf;

    /* Trigger = NOW; endTrigger = TRIG_REL_START con timeout */
    if (timeout_ms > 0) {
        RF_nrf24_cmdPropRxAdv.endTrigger.triggerType = TRIG_REL_START;
        RF_nrf24_cmdPropRxAdv.endTime = (uint32_t)(timeout_ms * 4000u); /* 4 µs ticks */
    } else {
        RF_nrf24_cmdPropRxAdv.endTrigger.triggerType = TRIG_NEVER;
        RF_nrf24_cmdPropRxAdv.endTime = 0;
    }

    RF_CmdHandle cmd = RF_runCmd(g_rfHandle,
                                  (RF_Op *)&RF_nrf24_cmdPropRxAdv,
                                  RF_PriorityNormal, NULL, 0);

    uint16_t status = RF_nrf24_cmdPropRxAdv.status;
    if (status == PROP_DONE_OK || status == PROP_DONE_ENDED) {
        *rssi_out = rxStats.lastRssi;
        *len_out  = RF_nrf24_cmdPropRxAdv.maxPktLen; /* promiscuo = siempre 37 */
        return true;
    }
    return false;
}

/**
 * process_and_report() — Parsea g_rxBuf como ESB y envía al host por UART.
 */
static void process_and_report(uint8_t channel, int8_t rssi, uint8_t raw_len)
{
    /* 1. Reportar paquete crudo siempre */
    {
        char hex_buf[75 + 1]; /* 37 bytes × 2 chars/byte = 74 chars + '\0' */
        static const char hx[] = "0123456789ABCDEF";
        uint16_t j = 0;
        for (uint8_t i = 0; i < raw_len && i < NRF24_RX_BUF_LEN; i++) {
            hex_buf[j++] = hx[g_rxBuf[i] >> 4];
            hex_buf[j++] = hx[g_rxBuf[i] & 0xFu];
        }
        hex_buf[j] = '\0';
        uart_printf("[PKT] ch=%03u rssi=%+04d len=%u raw=%s\r\n",
                    channel, (int)rssi, raw_len, hex_buf);
    }

    /* 2. Intentar parsear como ESB promiscuo */
    nrf24_frame_t frame;

    /* Buscar el inicio real del frame saltando los bytes de sync/preamble:
     * En g_rxBuf el CC1352P7 entrega el payload SIN el sync word (el RF core
     * usa el sync word para sincronizar pero no lo incluye en el buffer).
     * g_rxBuf[0] = primer byte de ADDRESS (tras el preamble).               */
    bool parsed;
    if (g_state.mode == MODE_DIRECTED) {
        parsed = esb_parse(g_rxBuf, raw_len, g_state.target_aw,
                            NRF24_CRC_1BYTE, &frame);
        if (!parsed) {
            parsed = esb_parse(g_rxBuf, raw_len, g_state.target_aw,
                                NRF24_CRC_2BYTE, &frame);
        }
    } else {
        parsed = esb_parse_promiscuous(g_rxBuf, raw_len, &frame);
    }

    if (!parsed) { return; }

    /* 3. Reportar frame ESB decodificado */
    char addr_str[11]; /* 5 bytes × 2 + '\0' */
    esb_addr_to_hex(&frame, addr_str);

    if (frame.is_ack) {
        uart_printf("[ACK] ch=%03u rssi=%+04d addr=%s empty\r\n",
                    channel, (int)rssi, addr_str);
        return;
    }

    /* Payload en hex */
    char pld_str[65]; /* 32 bytes × 2 + '\0' */
    static const char hx[] = "0123456789ABCDEF";
    uint16_t j = 0;
    for (uint8_t i = 0; i < frame.payload_len; i++) {
        pld_str[j++] = hx[frame.payload[i] >> 4];
        pld_str[j++] = hx[frame.payload[i] & 0xFu];
    }
    pld_str[j] = '\0';

    uart_printf("[ESB] ch=%03u rssi=%+04d addr=%s plen=%u pid=%u noack=%u pld=%s crc=%s\r\n",
                channel, (int)rssi, addr_str,
                frame.payload_len, frame.pid, (uint8_t)frame.no_ack,
                pld_str, frame.valid ? "OK" : "FAIL");
}

/* ── Callback de UART2 (NoRTOS: acumula bytes, señala comando completo) ────── */

