joscor34/CatSneeze_toolkit/firmware/nrf24_sniffer_cc1352p7/nrf24_sniffer.c
static void uart_read_callback(UART2_Handle handle, void *buf, size_t count,
                                void *userArg, int_fast16_t status)
{
    if (status == UART2_STATUS_SUCCESS && count > 0) {
        char c = g_rxChar;
        if (c == '\r' || c == '\n') {
            if (g_cmdIdx > 0) {
                g_cmdBuf[g_cmdIdx] = '\0';
                g_cmdReady = true;
                return; /* esperar a que main() procese el comando */
            }
        } else if (g_cmdIdx < NRF24_CMD_BUF_LEN - 1) {
            g_cmdBuf[g_cmdIdx++] = (char)toupper((int)c);
        }
    }
    /* Solicitar siguiente byte */
    UART2_read(handle, (void *)&g_rxChar, 1, NULL);
}

/* ── Tarea de comandos UART ──────────────────────────────────────────────────── */

/**
 * parse_hex_addr() — Parsea string "E7E7E7E7E7" a bytes.
 * @param s       String hexadecimal (10 chars para 5 bytes)
 * @param out     Buffer de salida (5 bytes)
 * @param out_aw  Address width (longitud detectada, 3-5)
 * @return true si el parse fue exitoso
 */
static bool parse_hex_addr(const char *s, uint8_t *out, uint8_t *out_aw)
{
    uint8_t len = (uint8_t)strlen(s);
    if (len < 6 || len > 10 || (len & 1u)) { return false; }
    *out_aw = (uint8_t)(len / 2);
    for (uint8_t i = 0; i < *out_aw; i++) {
        uint8_t hi = s[i * 2];
        uint8_t lo = s[i * 2 + 1];
        hi = (hi >= 'A') ? (hi - 'A' + 10) : (hi - '0');
        lo = (lo >= 'A') ? (lo - 'A' + 10) : (lo - '0');
        out[i] = (uint8_t)((hi << 4) | lo);
    }
    return true;
}

/**
 * parse_hex_bytes() — Parsea string hex a buffer de bytes.
 * @param s       String hexadecimal (pares de chars)
 * @param out     Buffer de salida
 * @param max_len Tamaño máximo del buffer de salida
 * @param out_len Bytes escritos en out
 * @return true si el parse fue exitoso
 */
static bool parse_hex_bytes(const char *s, uint8_t *out,
                             uint8_t max_len, uint8_t *out_len)
{
    uint8_t slen = (uint8_t)strlen(s);
    if (slen == 0u || (slen & 1u)) { return false; }
    *out_len = (uint8_t)(slen / 2);
    if (*out_len > max_len) { return false; }
    for (uint8_t i = 0; i < *out_len; i++) {
        uint8_t hi = (uint8_t)s[i * 2];
        uint8_t lo = (uint8_t)s[i * 2 + 1];
        hi = (hi >= 'A') ? (hi - 'A' + 10u) : (hi - '0');
        lo = (lo >= 'A') ? (lo - 'A' + 10u) : (lo - '0');
        out[i] = (uint8_t)((hi << 4) | lo);
    }
    return true;
}

static void handle_command(void)
{
            /* ── Parsear comando ── */
            if (strncmp(g_cmdBuf, "CH:", 3) == 0) {
                if (strcmp(g_cmdBuf + 3, "SCAN") == 0) {
                    g_state.mode = MODE_SCAN;
                    uart_puts("[CMD] mode=SCAN\r\n");
                } else {
                    uint8_t ch = (uint8_t)atoi(g_cmdBuf + 3);
                    if (ch <= 125) {
                        g_state.channel = ch;
                        g_state.mode    = MODE_PROMISC;
                        rf_set_channel(ch);
                        uart_printf("[CMD] ch=%03u freq=%uMHz\r\n",
                                    ch, (unsigned)(2400u + ch));
                    }
                }

            } else if (strncmp(g_cmdBuf, "ADDR:", 5) == 0) {
                uint8_t addr[5];
                uint8_t aw = 5;
                if (parse_hex_addr(g_cmdBuf + 5, addr, &aw)) {
                    memcpy(g_state.target_addr, addr, aw);
                    g_state.target_aw = aw;
                    g_state.mode = MODE_DIRECTED;
                    rf_set_sync_word_directed(addr, aw);
                    char hex[11];
                    static const char hx[] = "0123456789ABCDEF";
                    for (uint8_t i = 0; i < aw; i++) {
                        hex[i*2]   = hx[addr[i] >> 4];
                        hex[i*2+1] = hx[addr[i] & 0xFu];
                    }
                    hex[aw*2] = '\0';
                    uart_printf("[CMD] mode=DIRECTED addr=%s aw=%u\r\n", hex, aw);
                }

            } else if (strcmp(g_cmdBuf, "MODE:PROMISC") == 0) {
                g_state.mode = MODE_PROMISC;
                rf_set_sync_word_promisc();
                uart_puts("[CMD] mode=PROMISC\r\n");

            } else if (strcmp(g_cmdBuf, "RATE:1M") == 0) {
                g_state.rate = NRF24_RATE_1MBPS;
                uart_puts("[CMD] rate=1M (re-flash required for RF change)\r\n");

            } else if (strcmp(g_cmdBuf, "RATE:2M") == 0) {
                g_state.rate = NRF24_RATE_2MBPS;
                uart_puts("[CMD] rate=2M (re-flash required for RF change)\r\n");

            } else if (strcmp(g_cmdBuf, "RATE:250K") == 0) {
                g_state.rate = NRF24_RATE_250KBPS;
                uart_puts("[CMD] rate=250K (re-flash required for RF change)\r\n");

            /* ── TX:ADDR_HEX:PAYLOAD_HEX — spoof / inyección MouseJack ── */
            } else if (strncmp(g_cmdBuf, "TX:", 3) == 0) {
                /*
                 * Formato: TX:ADDR:PAYLOAD_HEX
                 *   ADDR       = 6-10 chars hex (3-5 bytes de dirección)
                 *   PAYLOAD_HEX = 0-64 chars hex (0-32 bytes de payload)
                 * Transmite un frame ESB construido con CRC-2 y NO_ACK=0.
                 */
                const char *p = g_cmdBuf + 3;
                const char *colon = strchr(p, ':');
                if (!colon) {
                    uart_puts("[TX] ERR bad format (TX:ADDR:PAYLOAD)\r\n");
                } else {
                    /* separar addr y payload */
                    char addr_str[11];
                    uint8_t addr_len = (uint8_t)(colon - p);
                    if (addr_len < 6u || addr_len > 10u) {
                        uart_puts("[TX] ERR addr length\r\n");
                    } else {
                        memcpy(addr_str, p, addr_len);
                        addr_str[addr_len] = '\0';

                        uint8_t addr[5]; uint8_t aw = 5;
                        if (!parse_hex_addr(addr_str, addr, &aw)) {
                            uart_puts("[TX] ERR addr parse\r\n");
                        } else {
                            uint8_t payload[ESB_MAX_PAYLOAD_LEN];
                            uint8_t plen = 0;
                            bool payload_ok = true;
                            if (*(colon + 1) != '\0') {
                                payload_ok = parse_hex_bytes(colon + 1, payload,
                                                              ESB_MAX_PAYLOAD_LEN, &plen);
                            }
                            if (!payload_ok) {
                                uart_puts("[TX] ERR payload parse\r\n");
                            } else {
                                uint8_t  frame[ESB_MAX_FRAME_LEN];
                                static uint8_t s_tx_pid = 0;
                                uint16_t flen = esb_build_frame(addr, aw,
                                                                 plen ? payload : NULL,
                                                                 plen, s_tx_pid, false,
                                                                 NRF24_CRC_2BYTE, frame);
                                s_tx_pid = (uint8_t)((s_tx_pid + 1u) & 0x03u);
                                if (flen == 0u) {
                                    uart_puts("[TX] ERR build frame\r\n");
                                } else if (rf_tx_frame(frame, (uint8_t)flen)) {
                                    uart_printf("[TX] OK addr=%s plen=%u flen=%u\r\n",
                                                addr_str, plen, (unsigned)flen);
                                } else {
                                    uart_puts("[TX] ERR rf_tx failed\r\n");
                                }
                            }
                        }
                    }
                }

