joscor34/CatSneeze_toolkit/firmware/nrf24_sniffer_cc1352p7/nrf24_sniffer.c
            /* ── REPLAY:RAW_HEX — retransmitir frame crudo capturado ── */
            } else if (strncmp(g_cmdBuf, "REPLAY:", 7) == 0) {
                /*
                 * Formato: REPLAY:RAW_HEX
                 *   RAW_HEX = frame ESB completo en hex (addr+PCF+payload+CRC)
                 * Retransmite los bytes exactos sin modificación (replay attack).
                 */
                uint8_t raw[ESB_MAX_FRAME_LEN];
                uint8_t rlen = 0;
                if (!parse_hex_bytes(g_cmdBuf + 7, raw, ESB_MAX_FRAME_LEN, &rlen)) {
                    uart_puts("[REPLAY] ERR parse\r\n");
                } else if (rf_tx_frame(raw, rlen)) {
                    uart_printf("[REPLAY] OK len=%u\r\n", (unsigned)rlen);
                } else {
                    uart_puts("[REPLAY] ERR rf_tx failed\r\n");
                }
            }
}

/* ── Entrypoint ────────────────────────────────────────────────────────────── */

int main(void)
{
    /* Inicializar el BSP (Board Support Package) de TI */
    Board_init();

    /* Inicializar NoRTOS (DPL bare-metal) */
    NoRTOS_start();

    /* Inicializar UART2 a 115200 baud (callback para RX, bloqueante para TX) */
    UART2_Params uartParams;
    UART2_Params_init(&uartParams);
    uartParams.baudRate  = NRF24_UART_BAUD;
    uartParams.readMode  = UART2_Mode_CALLBACK;
    uartParams.readCallback = uart_read_callback;
    uartParams.writeMode = UART2_Mode_BLOCKING;
    g_uart = UART2_open(CONFIG_UART2_0, &uartParams);

    /* Arrancar recepción asíncrona de primer byte */
    UART2_read(g_uart, (void *)&g_rxChar, 1, NULL);

    /* Inicializar RF */
    if (!rf_init()) {
        uart_puts("[ERR] RF init failed, halting\r\n");
        while (1) { ClockP_usleep(1000000); }
    }

    uart_puts("===== nRF24L01+ Sniffer (CC1352P7) =====\r\n");
    uart_printf("[INIT] ch=%03u freq=%uMHz rate=%s mode=%s\r\n",
                g_state.channel,
                (unsigned)(2400u + g_state.channel),
                g_state.rate == NRF24_RATE_1MBPS   ? "1M" :
                g_state.rate == NRF24_RATE_2MBPS   ? "2M" : "250K",
                g_state.mode == MODE_PROMISC  ? "PROMISC" :
                g_state.mode == MODE_DIRECTED ? "DIRECTED" : "SCAN");

    rf_set_sync_word_promisc();
    rf_set_channel(g_state.channel);

    /* ── Super-loop NoRTOS ─────────────────────────────────────────────────── */
    while (1) {
        /* Procesar comando UART pendiente */
        if (g_cmdReady) {
            handle_command();
            g_cmdReady = false;
            g_cmdIdx   = 0;
            UART2_read(g_uart, (void *)&g_rxChar, 1, NULL);
        }

        if (g_state.mode == MODE_SCAN) {
            /* Ciclar por todos los canales, 20 ms cada uno */
            for (uint8_t ch = 0; ch < NRF24_MAX_CHANNELS; ch++) {
                /* Atender comandos entre canales */
                if (g_cmdReady) {
                    handle_command();
                    g_cmdReady = false;
                    g_cmdIdx   = 0;
                    UART2_read(g_uart, (void *)&g_rxChar, 1, NULL);
                    if (g_state.mode != MODE_SCAN) { break; }
                }

                rf_set_channel(ch);
                uint8_t pkts = 0;
                int8_t  rssi_max = -120;

                uint32_t t_start    = ClockP_getSystemTicks();
                uint32_t tick_period = ClockP_getSystemTickPeriod();
                uint32_t dwell_ticks = (NRF24_SCAN_DWELL_MS * 1000u) / tick_period;

                while ((ClockP_getSystemTicks() - t_start) < dwell_ticks) {
                    int8_t  rssi  = -120;
                    uint8_t rlen  = 0;
                    if (rx_one_packet(&rssi, &rlen, NRF24_SCAN_DWELL_MS)) {
                        pkts++;
                        if (rssi > rssi_max) { rssi_max = rssi; }
                        process_and_report(ch, rssi, rlen);
                    }
                }
                uart_printf("[SCAN] ch=%03u active=%u pkts=%u rssi_max=%+04d\r\n",
                            ch, pkts > 0 ? 1u : 0u, pkts, (int)rssi_max);
            }

        } else {
            /* Modo PROMISC o DIRECTED: recibir en bucle */
            int8_t  rssi = -120;
            uint8_t rlen = 0;
            if (rx_one_packet(&rssi, &rlen, 1000u /* 1 s timeout */)) {
                process_and_report(g_state.channel, rssi, rlen);
            }
        }
    }
}
